USE courseworkdb;

INSERT INTO departments (name, address, phone)
VALUES ('Отдел кадров', 'ул. Ленина, 12', '+375291234567'),
       ('Бухгалтерия', 'ул. Советская, 34', '+375297654321'),
       ('Отдел продаж', 'ул. Пушкина, 56', '+375294567890'),
       ('Отдел разработки', 'ул. Гагарина, 78', '+375299876543'),
       ('Отдел маркетинга', 'ул. Кирова, 90', '+375296543210');

INSERT INTO workers (surname, name, patronymic, gender, status, military_registration, department_id)
VALUES ('Иванов', 'Иван', 'Иванович', 'Male', 'Hired', TRUE, 1),
       ('Петров', 'Петр', 'Петрович', 'Male', 'Fired', TRUE, 2),
       ('Сидоров', 'Сидор', 'Сидорович', 'Male', 'Retired', TRUE, 3),
       ('Смирнова', 'Анна', 'Алексеевна', 'Female', 'Hired', FALSE, 4),
       ('Кузнецова', 'Елена', 'Ивановна', 'Female', 'Hired', FALSE, 5),
       ('Попов', 'Алексей', 'Николаевич', 'Male', 'Fired', TRUE, 1),
       ('Соколов', 'Николай', 'Алексеевич', 'Male', 'Retired', TRUE, 2),
       ('Новикова', 'Мария', 'Петровна', 'Female', 'Hired', FALSE, 3),
       ('Морозова', 'Ольга', 'Сергеевна', 'Female', 'Hired', FALSE, 4),
       ('Волков', 'Сергей', 'Иванович', 'Male', 'Hired', TRUE, 5);

INSERT INTO positions (name, salary, department_id)
VALUES ('Начальник отдела кадров', 2000.00, 1),
       ('Специалист по подбору персонала', 1500.00, 1),
       ('Главный бухгалтер', 2500.00, 2),
       ('Бухгалтер', 1800.00, 2),
       ('Менеджер по продажам', 1700.00, 3),
       ('Продавец-консультант', 1200.00, 3),
       ('Ведущий разработчик', 3000.00, 4),
       ('Разработчик', 2200.00, 4),
       ('Маркетолог', 1900.00, 5),
       ('Дизайнер', 1600.00, 5);

INSERT INTO accepted_workers (worker_id, accept_date, position_id, actual_salary)
VALUES (1, '2021-01-01', 1, 2100.00),
       (2, '2021-01-03', 3, 2400.00),
       (3, '2021-01-05', 5, 1700.00),
       (4, '2021-01-15', 8, 2200.00),
       (5, '2021-01-20', 10, 1600.00),
       (6, '2021-01-21', 2, 1700.00),
       (7, '2021-01-22', 4, 1800.00),
       (8, '2021-01-24', 6, 1000.00),
       (9, '2021-01-26', 7, 3000.00),
       (10, '2021-02-10', 9, 1900.00);

INSERT INTO fired_workers (worker_id, fire_date, fire_reason)
VALUES (2, '2021-01-31', 'Нарушение трудовой дисциплины'),
       (6, '2021-02-15', 'Сокращение штата');

INSERT INTO retired_workers (worker_id, retire_date, pension)
VALUES (3, '2021-01-30', 800.00),
       (7, '2021-02-28', 900.00);
